
# tap repositories and their packages

tap 'homebrew/bundle'

tap 'homebrew/cask-fonts'
cask 'font-fira-code'

tap 'hashicorp/tap'
brew 'vault'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'warrensbox/tap'
brew 'tfswitch'

# Other Homebrew packages
brew 'act'
brew 'aom'
brew 'aribb24'
brew 'awscli'
brew 'boost'
brew 'brotli'
brew 'ca-certificates'
brew 'cairo'
brew 'capstone'
brew 'carthage'
brew 'cffi'
brew 'cjson'
brew 'dav1d'
brew 'devspace'
brew 'docker'
brew 'docutils'
brew 'double-conversion'
brew 'edencommon'
brew 'fb303'
brew 'fbthrift'
brew 'ffmpeg'
brew 'fizz'
brew 'flac'
brew 'fmt'
brew 'folly'
brew 'fontconfig'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'gdbm'
brew 'gettext'
brew 'gflags'
brew 'giflib'
brew 'git-lfs'
brew 'glib'
brew 'glog'
brew 'gmp'
brew 'gnutls'
brew 'graphite2'
brew 'harfbuzz'
brew 'helm'
brew 'highway'
brew 'icu4c'
brew 'imath'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'kubernetes-cli'
brew 'lame'
brew 'leptonica'
brew 'libarchive'
brew 'libass'
brew 'libb2'
brew 'libbluray'
brew 'libevent'
brew 'libidn2'
brew 'libnghttp2'
brew 'libogg'
brew 'libpng'
brew 'librist'
brew 'libsamplerate'
brew 'libslirp'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoxr'
brew 'libssh'
brew 'libtasn1'
brew 'libtiff'
brew 'libunibreak'
brew 'libunistring'
brew 'libusb'
brew 'libvidstab'
brew 'libvmaf'
brew 'libvorbis'
brew 'libvpx'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxrender'
brew 'libyaml'
brew 'little-cms2'
brew 'lz4'
brew 'lzo'
brew 'mas'
brew 'mbedtls'
brew 'minikube'
brew 'mpdecimal'
brew 'mpg123'
brew 'ncurses'
brew 'nettle'
brew 'nginx'
brew 'opencore-amr'
brew 'openexr'
brew 'openjpeg'
brew 'openssl@1.1'
brew 'openssl@3'
brew 'opus'
brew 'p11-kit'
brew 'pango'
brew 'pcre2'
brew 'pixman'
brew 'pnpm'
brew 'pycparser'
brew 'python@3.10'
brew 'python@3.11'
brew 'qemu'
brew 'rav1e'
brew 'readline'
brew 'rubberband'
brew 'ruby'
brew 'saml2aws'
brew 'sdl2'
brew 'six'
brew 'snappy'
brew 'spaceship'
brew 'speex'
brew 'sqlite'
brew 'srt'
brew 'svt-av1'
brew 'tesseract'
brew 'thefuck'
brew 'theora'
brew 'unbound'
brew 'vde'
brew 'wangle'
brew 'webp'
brew 'x264'
brew 'x265'
brew 'xorgproto'
brew 'xvid'
brew 'xz'
brew 'z'
brew 'zeromq'
brew 'zimg'
brew 'zsh-async'
brew 'zstd'

# Other Cask applications
cask '1password'
cask 'appcleaner'
cask 'github'
cask 'iterm2'
cask 'mockoon'
cask 'openlens'
cask 'rectangle'
cask 'visual-studio-code'

# App Store applications
mas 'Alfred (1.2)', id: 405843582
mas 'Final Cut Pro (10.6.5)', id: 424389933
mas 'Hand Mirror (3.0.1)', id: 1502839586
mas 'iHosts (1.4.0)', id: 1102004240
mas 'Keynote (12.2.1)', id: 409183694
mas 'Logic Pro (10.7.9)', id: 634148309
mas 'Numbers (12.2.1)', id: 409203825
mas 'Pages (12.2.1)', id: 409201541
mas 'Playgrounds (4.3.1)', id: 1496833156
mas 'Sequel Ace (4.0.5)', id: 1518036000
mas 'Xcode (14.3.1)', id: 497799835
