
# tap repositories and their packages

tap 'homebrew/bundle'

tap 'homebrew/cask-fonts'

tap 'hashicorp/tap'
brew 'vault'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'warrensbox/tap'
brew 'tfswitch'

# Other Homebrew packages
brew 'act'
brew 'aom'
brew 'apr'
brew 'apr-util'
brew 'argon2'
brew 'aribb24'
brew 'aspell'
brew 'autoconf'
brew 'awscli'
brew 'boost'
brew 'brotli'
brew 'ca-certificates'
brew 'cairo'
brew 'capstone'
brew 'carthage'
brew 'cffi'
brew 'cjson'
brew 'composer'
brew 'cryptography'
brew 'curl'
brew 'dav1d'
brew 'devspace'
brew 'docker'
brew 'docutils'
brew 'double-conversion'
brew 'dtc'
brew 'edencommon'
brew 'fb303'
brew 'fbthrift'
brew 'ffmpeg'
brew 'fizz'
brew 'flac'
brew 'fmt'
brew 'fnm'
brew 'folly'
brew 'fontconfig'
brew 'freetds'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'gd'
brew 'gdbm'
brew 'gettext'
brew 'gflags'
brew 'gh'
brew 'giflib'
brew 'git'
brew 'git-lfs'
brew 'glib'
brew 'glog'
brew 'gmp'
brew 'gnutls'
brew 'graphite2'
brew 'harfbuzz'
brew 'helm'
brew 'highway'
brew 'icu4c@76'
brew 'icu4c@77'
brew 'imath'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'jq'
brew 'krb5'
brew 'kubernetes-cli'
brew 'lame'
brew 'leptonica'
brew 'libarchive'
brew 'libass'
brew 'libavif'
brew 'libb2'
brew 'libbluray'
brew 'libdeflate'
brew 'libevent'
brew 'libidn2'
brew 'libmicrohttpd'
brew 'libnghttp2'
brew 'libnghttp3'
brew 'libngtcp2'
brew 'libogg'
brew 'libpng'
brew 'libpq'
brew 'librist'
brew 'libsamplerate'
brew 'libslirp'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoxr'
brew 'libssh'
brew 'libssh2'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libunibreak'
brew 'libunistring'
brew 'libusb'
brew 'libvidstab'
brew 'libvmaf'
brew 'libvorbis'
brew 'libvpx'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxrender'
brew 'libyaml'
brew 'libzip'
brew 'little-cms2'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'mas'
brew 'mbedtls'
brew 'minikube'
brew 'mkcert'
brew 'mpdecimal'
brew 'mpg123'
brew 'mvfst'
brew 'n'
brew 'ncurses'
brew 'net-snmp'
brew 'nettle'
brew 'nginx'
brew 'nspr'
brew 'nss'
brew 'oniguruma'
brew 'opencore-amr'
brew 'openexr'
brew 'openjdk@17'
brew 'openjdk@21'
brew 'openjpeg'
brew 'openjph'
brew 'openldap'
brew 'openssl@1.1'
brew 'openssl@3'
brew 'opus'
brew 'p11-kit'
brew 'pango'
brew 'pcre2'
brew 'php'
brew 'php@8.2'
brew 'pipx'
brew 'pixman'
brew 'pkgconf'
brew 'pnpm'
brew 'pycparser'
brew 'python@3.10'
brew 'python@3.11'
brew 'python@3.12'
brew 'python@3.13'
brew 'qemu'
brew 'rav1e'
brew 'rbenv'
brew 'readline'
brew 'rtmpdump'
brew 'rubberband'
brew 'ruby-build'
brew 'saml2aws'
brew 'sdl2'
brew 'six'
brew 'snappy'
brew 'spaceship'
brew 'speex'
brew 'sqlite'
brew 'srt'
brew 'svt-av1'
brew 'tesseract'
brew 'thefuck'
brew 'theora'
brew 'tidy-html5'
brew 'unbound'
brew 'unixodbc'
brew 'vde'
brew 'wangle'
brew 'webp'
brew 'x264'
brew 'x265'
brew 'xorgproto'
brew 'xvid'
brew 'xxhash'
brew 'xz'
brew 'z'
brew 'zeromq'
brew 'zimg'
brew 'zsh-async'
brew 'zstd'

# Other Cask applications
cask '1password'
cask 'appcleaner'
cask 'bruno'
cask 'dbeaver-community'
cask 'font-fira-code'
cask 'github'
cask 'imageoptim'
cask 'iterm2'
cask 'mockoon'
cask 'openlens'
cask 'rectangle'
cask 'visual-studio-code'
cask 'vlc'
