
# tap repositories and their packages

tap 'hashicorp/tap'
brew 'vault'

tap 'rcmdnk/file'
brew 'brew-file'

# Other Homebrew packages
brew 'aom'
brew 'apr'
brew 'apr-util'
brew 'argon2'
brew 'aspell'
brew 'autoconf'
brew 'awscli'
brew 'brotli'
brew 'ca-certificates'
brew 'cffi'
brew 'composer'
brew 'cryptography'
brew 'curl'
brew 'dav1d'
brew 'devspace'
brew 'docker'
brew 'fnm'
brew 'fontconfig'
brew 'freetds'
brew 'freetype'
brew 'gd'
brew 'gdbm'
brew 'gettext'
brew 'gh'
brew 'giflib'
brew 'git'
brew 'git-lfs'
brew 'gmp'
brew 'helm'
brew 'highway'
brew 'icu4c@77'
brew 'imath'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'jq'
brew 'krb5'
brew 'kubernetes-cli'
brew 'libavif'
brew 'libdeflate'
brew 'libnghttp2'
brew 'libnghttp3'
brew 'libngtcp2'
brew 'libpng'
brew 'libpq'
brew 'libsodium'
brew 'libssh2'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libvmaf'
brew 'libzip'
brew 'little-cms2'
brew 'lz4'
brew 'm4'
brew 'mas'
brew 'minikube'
brew 'mkcert'
brew 'mpdecimal'
brew 'net-snmp'
brew 'nginx'
brew 'oniguruma'
brew 'openexr'
brew 'openjph'
brew 'openldap'
brew 'openssl@1.1'
brew 'openssl@3'
brew 'pcre2'
brew 'php'
brew 'php@8.2'
brew 'pnpm'
brew 'pycparser'
brew 'python@3.10'
brew 'python@3.11'
brew 'python@3.12'
brew 'python@3.13'
brew 'readline'
brew 'rtmpdump'
brew 'six'
brew 'spaceship'
brew 'sqlite'
brew 'thefuck'
brew 'tidy-html5'
brew 'unixodbc'
brew 'webp'
brew 'xz'
brew 'z'
brew 'zsh-async'
brew 'zstd'

# Other Cask applications
cask '1password'
cask 'appcleaner'
cask 'bruno'
cask 'font-fira-code'
cask 'github'
cask 'imageoptim'
cask 'iterm2'
cask 'mockoon'
cask 'openlens'
cask 'rectangle'
cask 'visual-studio-code'
cask 'vlc'

# App Store applications
mas '1Password for Safari (8.11.12)', id: 1569813296
mas 'Alfred (1.2)', id: 405843582
mas 'Final Cut Pro (11.2)', id: 424389933
mas 'GIPHY CAPTURE (4.2)', id: 668208984
mas 'Hand Mirror (3.2)', id: 1502839586
mas 'iHosts (1.4.0)', id: 1102004240
mas 'iMovie (10.4.3)', id: 408981434
mas 'Keynote (14.4)', id: 409183694
mas 'Logic Pro (11.2.2)', id: 634148309
mas 'MainStage (3.7.1)', id: 634159523
mas 'MeetingBar (4.11.6)', id: 1532419400
mas 'Numbers (14.4)', id: 409203825
mas 'Pages (14.4)', id: 409201541
mas 'Sequel Ace (5.0.9)', id: 1518036000
mas 'SongPopParty (3.5.0)', id: 1551639567
mas 'Xcode (26.0.1)', id: 497799835
